Tekla.Structures.ModelInternal.GraphicsRenderer
For internal usage only for testing! Temporary class until new rendering is published

Tekla.Structures.ModelInternal.GraphicsRenderer.#ctor
Creates a new graphics drawer instance.

Tekla.Structures.ModelInternal.GraphicsRenderer.Draw(Tekla.Structures.ModelInternal.GraphicObjectContainer)
Draw a graphical object containing lines, polylines, surfaces and textss to all open Tekla Structures views.
graphicObject: The graphical object to draw.
Returns: True in success.

Tekla.Structures.ModelInternal.GraphicsRenderer.DrawToView(Tekla.Structures.ModelInternal.GraphicObjectContainer,System.Int32)
Draw a graphical object containing lines, polylines, surfaces and textss to all open Tekla Structures views.
graphicObject: The graphical object to draw.
viewId: The id of the view where the graphical object will be drawn.
Returns: True in success.

Tekla.Structures.ModelInternal.GraphicsRenderer.RemoveGraphicObjectContainer(Tekla.Structures.ModelInternal.GraphicObjectContainer)
Remove a graphic object container from all views.
graphicObject: The object to be removed.

Tekla.Structures.ModelInternal.GraphicsRenderer.RemoveGraphicObjectContainers(System.Collections.Generic.List{Tekla.Structures.ModelInternal.GraphicObjectContainer})
Remove a graphic object container from all views.
graphicObjects: The object to be removed.

Tekla.Structures.ModelInternal.GraphicsRenderer.RemoveAllGraphicObjectContainers(System.String)
Remove all graphic object containers from all views.